#### Terraform Plan Status: success

<details><summary>Show Plan</summary>

```
data.aws_sagemaker_prebuilt_ecr_image.sklearn: Reading...
aws_cloudwatch_event_rule.weekly_etl: Refreshing state... [id=nba-cap-production-weekly-etl]
aws_iam_role.eventbridge_step_functions: Refreshing state... [id=nba-cap-production-eventbridge-sfn]
data.aws_ami.amazon_linux_2023: Reading...
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/aws/apigateway/nba-cap-production-predictions-api]
aws_s3_bucket.frontend: Refreshing state... [id=nba-cap-frontend-production]
aws_api_gateway_rest_api.predictions_api: Refreshing state... [id=emmu64lij3]
data.aws_sagemaker_prebuilt_ecr_image.sklearn: Read complete after 0s [id=683313688378]
aws_s3_bucket.data: Refreshing state... [id=nba-cap-production-data]
aws_cloudwatch_event_rule.monthly_ml_training: Refreshing state... [id=nba-cap-production-monthly-ml-training]
aws_secretsmanager_secret.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-production-db-credentials-ERMGDY]
aws_iam_role.sagemaker_execution: Refreshing state... [id=nba-cap-production-sagemaker-execution]
aws_iam_role.ml_pipeline_sfn: Refreshing state... [id=nba-cap-production-ml-pipeline-sfn]
aws_cloudwatch_event_rule.monthly_etl: Refreshing state... [id=nba-cap-production-monthly-etl]
aws_iam_role.bastion: Refreshing state... [id=nba-cap-production-bastion-role]
aws_cloudfront_origin_access_identity.frontend: Refreshing state... [id=E2VD52SBPMIP38]
aws_iam_role.step_functions: Refreshing state... [id=nba-cap-production-step-functions]
aws_cloudwatch_event_rule.weekly_ml_predictions: Refreshing state... [id=nba-cap-production-weekly-ml-predictions]
aws_vpc.main: Refreshing state... [id=vpc-088de3bb69a05d62c]
aws_iam_role.eventbridge_sfn: Refreshing state... [id=nba-cap-production-eventbridge-sfn-ml]
aws_iam_role.lambda_execution: Refreshing state... [id=nba-cap-production-lambda-execution]
aws_api_gateway_resource.teams: Refreshing state... [id=b5ilzm]
aws_api_gateway_resource.metadata: Refreshing state... [id=xmkqhp]
aws_api_gateway_resource.predictions: Refreshing state... [id=dmmpfo]
aws_iam_role_policy_attachment.bastion_ssm: Refreshing state... [id=nba-cap-production-bastion-role-20260303011152372300000006]
aws_iam_instance_profile.bastion: Refreshing state... [id=nba-cap-production-bastion-profile]
aws_s3_bucket_versioning.data: Refreshing state... [id=nba-cap-production-data]
aws_s3_object.schema_sql: Refreshing state... [id=db/schema.sql]
aws_s3_object.salary_cap_static_data: Refreshing state... [id=static/salary_cap_history.json]
aws_s3_bucket_server_side_encryption_configuration.data: Refreshing state... [id=nba-cap-production-data]
aws_s3_object.feature_engineering_code: Refreshing state... [id=ml/code/feature_engineering.py]
aws_s3_object.migration_files["001_add_etl_run_tracking.sql"]: Refreshing state... [id=db/migrations/001_add_etl_run_tracking.sql]
aws_s3_object.migration_files["002_add_prediction_run_tracking.sql"]: Refreshing state... [id=db/migrations/002_add_prediction_run_tracking.sql]
aws_iam_role_policy_attachment.sagemaker_full_access: Refreshing state... [id=nba-cap-production-sagemaker-execution-20260303011150790900000005]
aws_iam_role_policy.sagemaker_custom: Refreshing state... [id=nba-cap-production-sagemaker-execution:nba-cap-production-sagemaker-custom]
aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=nba-cap-frontend-production]
aws_s3_bucket_website_configuration.frontend: Refreshing state... [id=nba-cap-frontend-production]
aws_api_gateway_method.metadata_get: Refreshing state... [id=agm-emmu64lij3-xmkqhp-GET]
aws_iam_role_policy.step_functions_lambda: Refreshing state... [id=nba-cap-production-step-functions:nba-cap-production-step-functions-lambda]
aws_api_gateway_resource.teams_detail: Refreshing state... [id=94ukhk]
aws_api_gateway_method.teams_get: Refreshing state... [id=agm-emmu64lij3-b5ilzm-GET]
aws_s3_bucket_policy.frontend: Refreshing state... [id=nba-cap-frontend-production]
aws_cloudfront_distribution.frontend: Refreshing state... [id=E3TQJJVGFO3EBX]
aws_api_gateway_resource.predictions_player: Refreshing state... [id=53evrc]
aws_api_gateway_resource.predictions_undervalued: Refreshing state... [id=u8v0re]
aws_api_gateway_resource.predictions_overvalued: Refreshing state... [id=vag7h2]
aws_api_gateway_method.predictions_get: Refreshing state... [id=agm-emmu64lij3-dmmpfo-GET]
aws_lambda_function.fetch_data: Refreshing state... [id=nba-cap-production-fetch-data]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=nba-cap-production-lambda-execution-20260218010820292900000003]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=nba-cap-production-lambda-execution-20260218010820284300000002]
aws_lambda_function.transform_data: Refreshing state... [id=nba-cap-production-transform-data]
aws_iam_role_policy.lambda_s3_rds: Refreshing state... [id=nba-cap-production-lambda-execution:nba-cap-production-lambda-s3-rds]
aws_lambda_function.copy_trained_model: Refreshing state... [id=nba-cap-production-copy-trained-model]
module.cors_metadata.aws_api_gateway_method.options: Refreshing state... [id=agm-emmu64lij3-xmkqhp-OPTIONS]
aws_lambda_function.validate_data: Refreshing state... [id=nba-cap-production-validate-data]
module.cors_teams.aws_api_gateway_method.options: Refreshing state... [id=agm-emmu64lij3-b5ilzm-OPTIONS]
module.cors_predictions.aws_api_gateway_method.options: Refreshing state... [id=agm-emmu64lij3-dmmpfo-OPTIONS]
aws_api_gateway_method.teams_detail_get: Refreshing state... [id=agm-emmu64lij3-94ukhk-GET]
aws_api_gateway_method.predictions_overvalued_get: Refreshing state... [id=agm-emmu64lij3-vag7h2-GET]
data.aws_ami.amazon_linux_2023: Read complete after 1s [id=ami-0aae19d30bab785d3]
aws_api_gateway_method.predictions_player_get: Refreshing state... [id=agm-emmu64lij3-53evrc-GET]
aws_api_gateway_method.predictions_undervalued_get: Refreshing state... [id=agm-emmu64lij3-u8v0re-GET]
module.cors_metadata.aws_api_gateway_integration.options: Refreshing state... [id=agi-emmu64lij3-xmkqhp-OPTIONS]
module.cors_metadata.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-emmu64lij3-xmkqhp-OPTIONS-200]
module.cors_teams_detail.aws_api_gateway_method.options: Refreshing state... [id=agm-emmu64lij3-94ukhk-OPTIONS]
module.cors_teams.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-emmu64lij3-b5ilzm-OPTIONS-200]
module.cors_teams.aws_api_gateway_integration.options: Refreshing state... [id=agi-emmu64lij3-b5ilzm-OPTIONS]
module.cors_predictions_overvalued.aws_api_gateway_method.options: Refreshing state... [id=agm-emmu64lij3-vag7h2-OPTIONS]
module.cors_predictions_player.aws_api_gateway_method.options: Refreshing state... [id=agm-emmu64lij3-53evrc-OPTIONS]
module.cors_predictions_undervalued.aws_api_gateway_method.options: Refreshing state... [id=agm-emmu64lij3-u8v0re-OPTIONS]
module.cors_predictions.aws_api_gateway_integration.options: Refreshing state... [id=agi-emmu64lij3-dmmpfo-OPTIONS]
module.cors_predictions.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-emmu64lij3-dmmpfo-OPTIONS-200]
module.cors_metadata.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-emmu64lij3-xmkqhp-OPTIONS-200]
module.cors_teams_detail.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-emmu64lij3-94ukhk-OPTIONS-200]
module.cors_teams_detail.aws_api_gateway_integration.options: Refreshing state... [id=agi-emmu64lij3-94ukhk-OPTIONS]
module.cors_predictions_player.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-emmu64lij3-53evrc-OPTIONS-200]
module.cors_predictions_player.aws_api_gateway_integration.options: Refreshing state... [id=agi-emmu64lij3-53evrc-OPTIONS]
module.cors_teams.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-emmu64lij3-b5ilzm-OPTIONS-200]
module.cors_predictions_overvalued.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-emmu64lij3-vag7h2-OPTIONS-200]
module.cors_predictions_overvalued.aws_api_gateway_integration.options: Refreshing state... [id=agi-emmu64lij3-vag7h2-OPTIONS]
module.cors_predictions_undervalued.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-emmu64lij3-u8v0re-OPTIONS-200]
module.cors_predictions_undervalued.aws_api_gateway_integration.options: Refreshing state... [id=agi-emmu64lij3-u8v0re-OPTIONS]
module.cors_predictions.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-emmu64lij3-dmmpfo-OPTIONS-200]
aws_security_group.rds: Refreshing state... [id=sg-09bb4d375219c7e6d]
aws_subnet.private_a: Refreshing state... [id=subnet-00f6190bd2afce4e4]
aws_security_group.bastion: Refreshing state... [id=sg-0cc2174642419bfb2]
aws_subnet.private_b: Refreshing state... [id=subnet-059c93d9c9c7ee475]
aws_internet_gateway.main: Refreshing state... [id=igw-0aea3ad60ae6ff38e]
aws_security_group.lambda: Refreshing state... [id=sg-05debbf01c56c0ea6]
aws_subnet.public: Refreshing state... [id=subnet-05e30333f77fc845d]
aws_security_group.vpc_endpoints: Refreshing state... [id=sg-0f0e76c9a6cdc0051]
aws_route_table.private: Refreshing state... [id=rtb-01a208610dd2f3c57]
module.cors_teams_detail.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-emmu64lij3-94ukhk-OPTIONS-200]
module.cors_predictions_player.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-emmu64lij3-53evrc-OPTIONS-200]
module.cors_predictions_overvalued.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-emmu64lij3-vag7h2-OPTIONS-200]
module.cors_predictions_undervalued.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-emmu64lij3-u8v0re-OPTIONS-200]
aws_route_table.public: Refreshing state... [id=rtb-00b7b6779cafecbe8]
aws_security_group_rule.rds_from_bastion: Refreshing state... [id=sgrule-1849267350]
aws_route_table_association.private_a: Refreshing state... [id=rtbassoc-006d2593e61c7d847]
aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0db20acb81ee0d099]
aws_route_table_association.private_b: Refreshing state... [id=rtbassoc-05f0d0f9980c0443e]
aws_lambda_function.migrate_schema: Refreshing state... [id=nba-cap-production-migrate-schema]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-0cdfa2ca1b0a6b64a]
aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-0b4053fadfd6f42b2]
aws_db_subnet_group.main: Refreshing state... [id=nba-cap-production-db-subnet]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0ce948c7fa0663c3d]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-04400a928e0f2aeb5]
aws_instance.bastion: Refreshing state... [id=i-0b4d17a8066977fd9]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-0fa82d8308dfa516a]
aws_db_instance.main: Refreshing state... [id=db-3AM3DRKG3TQSH5UMNCYBMHPGWU]
null_resource.trigger_schema_migration: Refreshing state... [id=7939887649714840246]
aws_secretsmanager_secret_version.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-production-db-credentials-ERMGDY|terraform-2026030301204414690000000a]
aws_cloudwatch_metric_alarm.rds_cpu: Refreshing state... [id=nba-cap-production-rds-high-cpu]
aws_lambda_function.load_to_rds: Refreshing state... [id=nba-cap-production-load-to-rds]
aws_lambda_function.extract_prediction_data: Refreshing state... [id=nba-cap-production-extract-prediction-data]
aws_lambda_function.load_predictions: Refreshing state... [id=nba-cap-production-load-predictions]
aws_lambda_function.extract_training_data: Refreshing state... [id=nba-cap-production-extract-training-data]
aws_lambda_function.api_handler: Refreshing state... [id=nba-cap-production-api-handler]
aws_sfn_state_machine.ml_predictions_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-production-ml-predictions-pipeline]
aws_sfn_state_machine.etl_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-production-etl-pipeline]
aws_iam_role_policy.ml_pipeline_sfn: Refreshing state... [id=nba-cap-production-ml-pipeline-sfn:nba-cap-production-ml-pipeline-sfn-policy]
aws_sfn_state_machine.ml_training_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-production-ml-training-pipeline]
aws_iam_role_policy.eventbridge_step_functions: Refreshing state... [id=nba-cap-production-eventbridge-sfn:nba-cap-production-eventbridge-sfn-policy]
aws_cloudwatch_metric_alarm.etl_failures: Refreshing state... [id=nba-cap-production-etl-failures]
aws_cloudwatch_event_target.weekly_etl_pipeline: Refreshing state... [id=nba-cap-production-weekly-etl-WeeklyETLStateMachine]
aws_cloudwatch_event_target.monthly_etl_pipeline: Refreshing state... [id=nba-cap-production-monthly-etl-MonthlyETLStateMachine]
aws_cloudwatch_event_target.monthly_training_target: Refreshing state... [id=nba-cap-production-monthly-ml-training-MonthlyMLTrainingPipeline]
aws_api_gateway_integration.teams_get: Refreshing state... [id=agi-emmu64lij3-b5ilzm-GET]
aws_api_gateway_integration.teams_detail_get: Refreshing state... [id=agi-emmu64lij3-94ukhk-GET]
aws_lambda_permission.api_gateway: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.metadata_get: Refreshing state... [id=agi-emmu64lij3-xmkqhp-GET]
aws_api_gateway_integration.predictions_get: Refreshing state... [id=agi-emmu64lij3-dmmpfo-GET]
aws_api_gateway_integration.predictions_overvalued_get: Refreshing state... [id=agi-emmu64lij3-vag7h2-GET]
aws_api_gateway_integration.predictions_player_get: Refreshing state... [id=agi-emmu64lij3-53evrc-GET]
aws_api_gateway_integration.predictions_undervalued_get: Refreshing state... [id=agi-emmu64lij3-u8v0re-GET]
aws_cloudwatch_event_target.weekly_predictions_target: Refreshing state... [id=nba-cap-production-weekly-ml-predictions-WeeklyMLPredictionsPipeline]
aws_iam_role_policy.eventbridge_sfn: Refreshing state... [id=nba-cap-production-eventbridge-sfn-ml:nba-cap-production-eventbridge-sfn-policy]
aws_api_gateway_deployment.predictions_api: Refreshing state... [id=hrurd5]
aws_api_gateway_stage.v1: Refreshing state... [id=ags-emmu64lij3-v1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.api[0] will be created
  + resource "aws_acm_certificate" "api" {
      + arn                       = (known after apply)
      + domain_name               = "api.dunkonomics.net"
      + domain_validation_options = [
          + {
              + domain_name           = "api.dunkonomics.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "api.dunkonomics.net",
        ]
      + tags                      = {
          + "Environment" = "production"
          + "Name"        = "dunkonomics.net API Certificate"
          + "Project"     = "nba-cap"
        }
      + tags_all                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dunkonomics.net API Certificate"
          + "Project"     = "nba-cap"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.frontend[0] will be created
  + resource "aws_acm_certificate" "frontend" {
      + arn                       = (known after apply)
      + domain_name               = "www.dunkonomics.net"
      + domain_validation_options = [
          + {
              + domain_name           = "dunkonomics.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.dunkonomics.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "dunkonomics.net",
          + "www.dunkonomics.net",
        ]
      + tags                      = {
          + "Environment" = "production"
          + "Name"        = "dunkonomics.net Frontend Certificate"
          + "Project"     = "nba-cap"
        }
      + tags_all                  = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dunkonomics.net Frontend Certificate"
          + "Project"     = "nba-cap"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.api[0] will be created
  + resource "aws_acm_certificate_validation" "api" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.frontend[0] will be created
  + resource "aws_acm_certificate_validation" "frontend" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_api_gateway_base_path_mapping.api[0] will be created
  + resource "aws_api_gateway_base_path_mapping" "api" {
      + api_id      = "emmu64lij3"
      + domain_name = "api.dunkonomics.net"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_domain_name.api[0] will be created
  + resource "aws_api_gateway_domain_name" "api" {
      + arn                                    = (known after apply)
      + certificate_arn                        = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "api.dunkonomics.net"
      + domain_name_id                         = (known after apply)
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags                                   = {
          + "Environment" = "production"
          + "Name"        = "dunkonomics.net API Domain"
          + "Project"     = "nba-cap"
        }
      + tags_all                               = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dunkonomics.net API Domain"
          + "Project"     = "nba-cap"
        }
    }

  # aws_cloudfront_distribution.frontend will be updated in-place
  ~ resource "aws_cloudfront_distribution" "frontend" {
      ~ aliases                        = [
          + "dunkonomics.net",
          + "www.dunkonomics.net",
        ]
        id                             = "E3TQJJVGFO3EBX"
        tags                           = {
            "Environment" = "production"
            "Name"        = "nba-cap-frontend-cdn"
            "Project"     = "nba-cap"
        }
        # (19 unchanged attributes hidden)

      ~ viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          ~ cloudfront_default_certificate = true -> false
          ~ minimum_protocol_version       = "TLSv1" -> "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
        }

        # (5 unchanged blocks hidden)
    }

  # aws_db_instance.main will be updated in-place
  ~ resource "aws_db_instance" "main" {
      ~ final_snapshot_identifier             = "nba-cap-production-final-snapshot-2026-03-03-0245" -> (known after apply)
        id                                    = "db-3AM3DRKG3TQSH5UMNCYBMHPGWU"
      - password                              = (sensitive value) -> null
        tags                                  = {
            "Environment" = "production"
            "Project"     = "nba-cap"
        }
        # (55 unchanged attributes hidden)
    }

  # aws_route53_record.api[0] will be created
  + resource "aws_route53_record" "api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.dunkonomics.net"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.api_cert_validation["api.dunkonomics.net"] will be created
  + resource "aws_route53_record" "api_cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.frontend_cert_validation["dunkonomics.net"] will be created
  + resource "aws_route53_record" "frontend_cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.frontend_cert_validation["www.dunkonomics.net"] will be created
  + resource "aws_route53_record" "frontend_cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.frontend_root[0] will be created
  + resource "aws_route53_record" "frontend_root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dunkonomics.net"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = "dflwwr47ck1jv.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_route53_record.frontend_www[0] will be created
  + resource "aws_route53_record" "frontend_www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.dunkonomics.net"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = "dflwwr47ck1jv.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_route53_zone.main[0] will be created
  + resource "aws_route53_zone" "main" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dunkonomics.net"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Environment" = "production"
          + "Name"        = "dunkonomics.net"
          + "Project"     = "nba-cap"
        }
      + tags_all            = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dunkonomics.net"
          + "Project"     = "nba-cap"
        }
      + zone_id             = (known after apply)
    }

  # aws_secretsmanager_secret_version.db_credentials must be replaced
-/+ resource "aws_secretsmanager_secret_version" "db_credentials" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-production-db-credentials-ERMGDY" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-production-db-credentials-ERMGDY|terraform-2026030301204414690000000a" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-2026030301204414690000000a" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_security_group_rule.rds_from_bastion will be created
  + resource "aws_security_group_rule" "rds_from_bastion" {
      + description              = "PostgreSQL from bastion host"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-09bb4d375219c7e6d"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0cc2174642419bfb2"
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 15 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  + custom_domain_api        = "https://api.dunkonomics.net/v1"
  + custom_domain_frontend   = "https://www.dunkonomics.net"
  + route53_nameservers      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Workspace:** prod
**Environment:** production
